import galaxyvis from "../src/galaxyVis";

{
    var divBox = document.getElementById("container");

    var div = document.createElement("div");

    let a = [{ name: '关闭/开启地图（再次开启将设置点能拖动）', id: "in" }, { name: "导出png", id: "out" }]

    div.setAttribute('style', `
                display: block;
                position: absolute;
                top: 20px;
                right: 20px;
                padding: 10px;
                box-shadow: 0 1px 5px rgb(0 0 0 / 65%);
                border-radius: 4px;
                background: #ffffff;
                color: #222222;
                font-weight: 300;
                z-index: 9999;
                height: 75px;
                width: 150px;
            `)
    divBox.appendChild(div);

    for (let index = 0; index < a.length; index++) {
        var buttom = document.createElement("button")
        buttom.innerText = a[index].name;
        buttom.id = a[index].id;
        buttom.onclick = function (e) {
            // @ts-ignore
            let AnimationType = this.id;
            zoomEffeft(AnimationType)
        }
        buttom.setAttribute('style', `width:100%; margin-bottom: 10px;display: block;`)
        div.appendChild(buttom);
    }

}


let renderer = "webgl"
let galaxyVis = new galaxyvis({
    container: 'container',
    renderer: renderer,
    options: {
        backgroundColor: "#F9FBFF",
    }
})

const geo = () => {

    galaxyVis.addGraph({
        nodes: [

            {
                "id": "0",
                "attribute": {
                    "x": 24.74795872449447,
                    "y": -8.568446495137641,
                    "text": "曹桂珍"
                },
                "data": {
                    "primaryKey": "1",
                    "cl$_type": "人",
                    "姓名": "曹桂珍",
                    "并发症": "脑炎",
                    "确诊时间": 1649219883000,
                    "纬度": "31.2825998",
                    "入院症状和体征": "乏力、头晕、肌肉酸痛",
                    "病例发现途径": "流感、SARI 等常规监测发现",
                    "联系电话": "968****065",
                    "经度": "121.5187342",
                    "核酸状态": "阳性",
                    "身份证号": "111424********9552",
                    "年龄": "26",
                    "编号": "1",
                    "性别": "男",
                    "layer": 1,
                    "depth": 0
                }
            },
            {
                "id": "1048576",
                "attribute": {
                    "x": 101.69407910641272,
                    "y": 58.25499376089074,
                    "text": "林楠"
                },
                "data": {
                    "primaryKey": "2",
                    "cl$_type": "人",
                    "姓名": "林楠",
                    "纬度": "31.2012",
                    "联系电话": "891****926",
                    "经度": "121.60078",
                    "核酸状态": "待核酸",
                    "身份证号": "316572********9189",
                    "年龄": "59",
                    "编号": "2",
                    "性别": "男",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "2097152",
                "attribute": {
                    "x": 86.56438924243957,
                    "y": 18.202671461205483,
                    "text": "杨玉兰"
                },
                "data": {
                    "primaryKey": "3",
                    "cl$_type": "人",
                    "姓名": "杨玉兰",
                    "并发症": "急性肺损伤/ARDS",
                    "确诊时间": 1649404911000,
                    "纬度": "31.1942987",
                    "入院症状和体征": "流涕、咽痛、肌肉酸痛",
                    "病例发现途径": "流感、SARI 等常规监测发现",
                    "联系电话": "356****685",
                    "经度": "121.5355569",
                    "核酸状态": "阳性",
                    "身份证号": "503739********4805",
                    "年龄": "37",
                    "编号": "3",
                    "性别": "女",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "2097155",
                "attribute": {
                    "x": 93.92681009118625,
                    "y": -60.00366367406519,
                    "text": "李秀英"
                },
                "data": {
                    "primaryKey": "99",
                    "cl$_type": "人",
                    "姓名": "李秀英",
                    "纬度": "31.2829336",
                    "联系电话": "435****050",
                    "经度": "121.5111645",
                    "核酸状态": "待核酸",
                    "身份证号": "669438********9155",
                    "年龄": "60",
                    "编号": "99",
                    "性别": "男",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "3145728",
                "attribute": {
                    "x": -14.14475321830293,
                    "y": 92.96837225115424,
                    "text": "林畅"
                },
                "data": {
                    "primaryKey": "4",
                    "cl$_type": "人",
                    "姓名": "林畅",
                    "确诊时间": 1649471672000,
                    "纬度": "31.2610139",
                    "入院症状和体征": "咳痰、鼻塞、肌肉酸痛",
                    "病例发现途径": "主动就诊",
                    "联系电话": "658****322",
                    "经度": "121.5405352",
                    "核酸状态": "阳性",
                    "身份证号": "375809********7140",
                    "年龄": "20",
                    "编号": "4",
                    "性别": "女",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "4194304",
                "attribute": {
                    "x": 24.697652435613914,
                    "y": 114.72384552482261,
                    "text": "程想"
                },
                "data": {
                    "primaryKey": "5",
                    "cl$_type": "人",
                    "姓名": "程想",
                    "确诊时间": 1649455297000,
                    "纬度": "31.2445783",
                    "入院症状和体征": "发热、寒战、干咳、头痛",
                    "病例发现途径": "主动就诊",
                    "联系电话": "925****703",
                    "经度": "121.6351204",
                    "核酸状态": "阳性",
                    "身份证号": "360917********3172",
                    "年龄": "31",
                    "编号": "5",
                    "性别": "女",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "5242880",
                "attribute": {
                    "x": -86.21840598980637,
                    "y": -37.25381171065661,
                    "text": "马欢"
                },
                "data": {
                    "primaryKey": "6",
                    "cl$_type": "人",
                    "姓名": "马欢",
                    "确诊时间": 1649475351000,
                    "纬度": "31.2400557",
                    "入院症状和体征": "流涕、咽痛、肌肉酸痛",
                    "病例发现途径": "主动就诊",
                    "联系电话": "033****626",
                    "经度": "121.478708",
                    "核酸状态": "阳性",
                    "身份证号": "798103********7618",
                    "年龄": "53",
                    "编号": "6",
                    "性别": "女",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "6291456",
                "attribute": {
                    "x": -18.98707973957126,
                    "y": -96.87569405378783,
                    "text": "王桂珍"
                },
                "data": {
                    "primaryKey": "7",
                    "cl$_type": "人",
                    "姓名": "王桂珍",
                    "确诊时间": 1649674916000,
                    "纬度": "31.2151853",
                    "入院症状和体征": "咳痰、鼻塞、肌肉酸痛",
                    "病例发现途径": "主动就诊",
                    "联系电话": "890****705",
                    "经度": "121.5812269",
                    "核酸状态": "阳性",
                    "身份证号": "796870********2340",
                    "年龄": "27",
                    "编号": "7",
                    "性别": "女",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "7340032",
                "attribute": {
                    "x": -80.43012989772127,
                    "y": 56.90627899720439,
                    "text": "胡玉梅"
                },
                "data": {
                    "primaryKey": "8",
                    "cl$_type": "人",
                    "姓名": "胡玉梅",
                    "确诊时间": 1649455297000,
                    "纬度": "31.227889",
                    "入院症状和体征": "发热、寒战、干咳、头痛",
                    "病例发现途径": "主动就诊",
                    "联系电话": "924****120",
                    "经度": "121.5166037",
                    "核酸状态": "阳性",
                    "身份证号": "626193********6245",
                    "年龄": "42",
                    "编号": "8",
                    "性别": "男",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "8388608",
                "attribute": {
                    "x": -97.2749174117998,
                    "y": 11.626242612294126,
                    "text": "王洋"
                },
                "data": {
                    "primaryKey": "9",
                    "cl$_type": "人",
                    "姓名": "王洋",
                    "确诊时间": 1649475351000,
                    "纬度": "31.2486199",
                    "入院症状和体征": "流涕、咽痛、肌肉酸痛",
                    "病例发现途径": "主动就诊",
                    "联系电话": "116****951",
                    "经度": "121.5665342",
                    "核酸状态": "阳性",
                    "身份证号": "265615********1227",
                    "年龄": "52",
                    "编号": "9",
                    "性别": "女",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "9437184",
                "attribute": {
                    "x": -47.25976933782251,
                    "y": 68.46667928301119,
                    "text": "林华"
                },
                "data": {
                    "primaryKey": "10",
                    "cl$_type": "人",
                    "姓名": "林华",
                    "确诊时间": 1649674916000,
                    "纬度": "31.2133286",
                    "入院症状和体征": "咳痰、鼻塞、肌肉酸痛",
                    "病例发现途径": "主动就诊",
                    "联系电话": "012****703",
                    "经度": "121.6192358",
                    "核酸状态": "阳性",
                    "身份证号": "981590********0834",
                    "年龄": "37",
                    "编号": "10",
                    "性别": "男",
                    "layer": 3,
                    "depth": 1
                }
            },
            {
                "id": "33554432",
                "attribute": {
                    "x": 39.63167328874925,
                    "y": -76.11366150659043,
                    "text": "小红中心医院s座"
                },
                "data": {
                    "primaryKey": "小红中心医院s座",
                    "cl$_type": "场所",
                    "纬度": "31.274142",
                    "地址名称": "小红中心医院s座",
                    "经度": "121.517665",
                    "layer": 2
                }
            },
            {
                "id": "40894465",
                "attribute": {
                    "x": 41.81510658097595,
                    "y": 61.54314305295833,
                    "text": "玉英客运站宜都街C座"
                },
                "data": {
                    "primaryKey": "玉英客运站宜都街C座",
                    "cl$_type": "场所",
                    "纬度": "31.2082756",
                    "地址名称": "玉英客运站宜都街C座",
                    "经度": "121.5935601",
                    "layer": 2
                }
            },
            {
                "id": "44040192",
                "attribute": {
                    "x": -40.041927170403696,
                    "y": 9.932984660946754,
                    "text": "英机路画展Z座"
                },
                "data": {
                    "primaryKey": "英机路画展Z座",
                    "cl$_type": "场所",
                    "纬度": "31.199698",
                    "地址名称": "英机路画展Z座",
                    "经度": "121.5321547",
                    "layer": 2
                }
            },
            {
                "id": "44040193",
                "attribute": {
                    "x": -35.63648741134267,
                    "y": -50.895210648128575,
                    "text": "琴客棋牌所S座"
                },
                "data": {
                    "primaryKey": "琴客棋牌所S座",
                    "cl$_type": "场所",
                    "纬度": "31.2097215",
                    "地址名称": "琴客棋牌所S座",
                    "经度": "121.5132489",
                    "layer": 2
                }
            }

        ],
        edges: [
            {
                "id": "00000000000000000004000005F5E190",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000000000000004000005F5E190",
                    "cl$_type": "逗留",
                    "开始时间": 1648798380000,
                    "时长": "2.0小时",
                    "layer": 1
                },
                "source": "0",
                "target": "44040193"
            },
            {
                "id": "00000000000000000004000005F5E148",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000000000000004000005F5E148",
                    "cl$_type": "逗留",
                    "开始时间": 1649219880000,
                    "时长": "10.0 小时",
                    "layer": 1
                },
                "source": "0",
                "target": "33554432"
            },
            {
                "id": "00000000000000000004000005F5E19D",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000000000000004000005F5E19D",
                    "cl$_type": "逗留",
                    "开始时间": 1648614780000,
                    "时长": "3.4小时",
                    "layer": 1
                },
                "source": "0",
                "target": "40894465"
            },
            {
                "id": "00000000000000000004000005F5E181",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000000000000004000005F5E181",
                    "cl$_type": "逗留",
                    "开始时间": 1648884780000,
                    "时长": "1.5小时",
                    "layer": 1
                },
                "source": "0",
                "target": "44040192"
            },
            {
                "id": "00000000003000000004000005F5E199",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000003000000004000005F5E199",
                    "cl$_type": "逗留",
                    "开始时间": 1648619340000,
                    "时长": "1.5小时",
                    "layer": 2
                },
                "source": "3145728",
                "target": "40894465"
            },
            {
                "id": "00000000002000030004000005F5E147",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000002000030004000005F5E147",
                    "cl$_type": "逗留",
                    "开始时间": 1649220360000,
                    "时长": "5.2 小时",
                    "layer": 2
                },
                "source": "2097155",
                "target": "33554432"
            },
            {
                "id": "00000000005000000004000005F5E18F",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000005000000004000005F5E18F",
                    "cl$_type": "逗留",
                    "开始时间": 1648798560000,
                    "时长": "3.6小时",
                    "layer": 2
                },
                "source": "5242880",
                "target": "44040193"
            },
            {
                "id": "00000000004000000004000005F5E19C",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000004000000004000005F5E19C",
                    "cl$_type": "逗留",
                    "开始时间": 1648614960000,
                    "时长": "1.5小时",
                    "layer": 2
                },
                "source": "4194304",
                "target": "40894465"
            },
            {
                "id": "00000000001000000004000005F5E19B",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000001000000004000005F5E19B",
                    "cl$_type": "逗留",
                    "开始时间": 1648617600000,
                    "时长": "3.0小时",
                    "layer": 2
                },
                "source": "1048576",
                "target": "40894465"
            },
            {
                "id": "00000000008000000004000005F5E183",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000008000000004000005F5E183",
                    "cl$_type": "逗留",
                    "开始时间": 1648880040000,
                    "时长": "3.5小时",
                    "layer": 2
                },
                "source": "8388608",
                "target": "44040192"
            },
            {
                "id": "00000000002000000004000005F5E19A",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000002000000004000005F5E19A",
                    "cl$_type": "逗留",
                    "开始时间": 1648617960000,
                    "时长": "1.6小时",
                    "layer": 2
                },
                "source": "2097152",
                "target": "40894465"
            },
            {
                "id": "00000000009000000004000005F5E17F",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000009000000004000005F5E17F",
                    "cl$_type": "逗留",
                    "开始时间": 1648886340000,
                    "时长": "1.0小时",
                    "layer": 2
                },
                "source": "9437184",
                "target": "44040192"
            },
            {
                "id": "00000000007000000004000005F5E180",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000007000000004000005F5E180",
                    "cl$_type": "逗留",
                    "开始时间": 1648886040000,
                    "时长": "1.5小时",
                    "layer": 2
                },
                "source": "7340032",
                "target": "44040192"
            },
            {
                "id": "00000000006000000004000005F5E18E",
                "attribute": {
                    "text": "逗留"
                },
                "data": {
                    "primaryKey": "00000000006000000004000005F5E18E",
                    "cl$_type": "逗留",
                    "开始时间": 1648799640000,
                    "时长": "3.8小时",
                    "layer": 2
                },
                "source": "6291456",
                "target": "44040193"
            }
        ]
    })

    // cl$_type = "人 / 场所"

    galaxyVis.styles.addRule({
        nodeSelector: function (node) {
            return node.getData('cl$_type') === "人";
        },
        nodeAttributes: {
            color: '#FFA0A0',
            icon: {
                content:"\ue634"
            }
        }
    })

    galaxyVis.styles.addRule({
        nodeSelector: function (node) {
            return node.getData('cl$_type') === "场所";
        },
        nodeAttributes: {
            color: '#00B8FF',
            icon: {
                content:"\ue63a"
            }
        }
    })

    galaxyVis.geo.enable({
        minZoomLevel: 10,
        maxZoomLevel: 16,
        latitudePath: "纬度",
        longitudePath: "经度"
    })
}

geo();
var a = 0;
const zoomEffeft = (type: any) => {
    if (type == 'in') {
        if (a % 2 == 0)
            galaxyVis.geo.disable().then(() => {
                galaxyVis.layouts.force({}).then(() => {
                    galaxyVis.view.locateGraph({
                        padding: 8
                    })
                })
            })
        else
            galaxyVis.geo.enable({
                disableNodeDragging: false,
                minZoomLevel: 10,
                maxZoomLevel: 16,
                latitudePath: "纬度",
                longitudePath: "经度",
                duration: 500
            })
        a++;
    }

    if (type == "out") {
        galaxyVis.export.png()
    }
}


export default geo
